tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "awscli"
brew "bat"
brew "cloc"
brew "coreutils"
brew "findutils"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gibo"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "gh"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "hub"
brew "jq"
brew "less"
brew 'mackup'
brew 'mas' # Mac App Store manager
brew "moreutils"
brew "neovim"
brew "pv"
brew "pyenv"
brew "python"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "shpotify"
brew "telnet"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "todo-txt"
brew "trash"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"

cask "font-hack-nerd-font"
cask "font-jetbrainsmono-nerd-font"

cask "1password-cli"
cask "1password"
cask "alfred"
cask "bartender"
cask "beardedspice"
cask "cloudapp"
cask "dash"
cask "docker"
cask "dropbox"
cask "epubquicklook"
cask "firefox-developer-edition"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "ImageOptim"
cask "karabiner-elements"
cask "keybase"
cask "mongodb-compass"
cask "muzzle"
cask "notion"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "robo-3t"
cask "setapp"
cask "sketch"
cask "slack"
cask "spotify"
cask "todotxt"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

# Mac App Store
mas 'Spark', id: 1176895641
mas 'Things', id: 904280696
mas 'Twitter', id: 1482454543
mas 'Quip', id: 1003160018
mas 'Pixelmator', id: 407963104
mas 'Amphetamine', id: 937984704
mas 'uBlock', id: 1385985095
